ElectricCompany/app/Controllers/Register.php

INSERT INTO `users` (`first_name`, `last_name`, `email`, `phone`, `address`, `city`, `state`, `zip_code`, `password`, `user_type`, `is_active`, `email_verified`, `created_at`, `updated_at`) VALUES ('Cedrick Nicolas', 'Valera', 'cedrickvalera@yahoo.com', '09199832828', 'Blk 80 Lot64 Flotante At Laura St', 'Quezon', 'Metro Manila', '11100', '$2y$10$0Md1hqVQcGOPGrHjk6n3ceaagzCi8G81fUvFQ7Qdaj92CxjJFjkjW', 'customer', 1, 0, '2026-09-23 06:21:49', '2026-09-23 06:21:49')
---
        ];

        try {
            $userId = $this->userModel->insert($userData);